Repository: muhhaniffajar/flutter-ich-web
Catalog: lib/l10n/intl_*.arb
Languages: id

# appTitle
source: Intracranial Hemorrhage Classification
id: Klasifikasi Perdarahan Intrakranial

source: Back to Home
id: Kembali ke Beranda

source: Language
id: Bahasa

source: Choose Language
id: Pilih Bahasa

# whatIsICH
source: What is Intracranial Hemorrhage?
id: Apa itu Perdarahan Intrakranial?

# ichDescription
source: Intracranial hemorrhage (ICH) is a general term for bleeding inside the skull. It encompasses all types of brain bleeds, including subdural, intraparenchymal, intraventricular, subarachnoid, and epidural hemorrhages. ICH is commonly caused by trauma, high blood pressure, blood vessel abnormalities, or aneurysms. The symptoms of ICH vary depending on the location and severity of the bleed, and can range from headaches and dizziness to loss of consciousness or death. Prompt medical attention is required to manage ICH, and the treatment approach depends on the cause, type, and severity of the hemorrhage.
id: Perdarahan intrakranial (ICH) adalah istilah umum untuk perdarahan di dalam tengkorak. Ini mencakup semua jenis perdarahan otak, termasuk perdarahan subdural, intraparenchymal, intraventricular, subarachnoid, dan epidural. ICH biasanya disebabkan oleh trauma, tekanan darah tinggi, kelainan pembuluh darah, atau aneurisma. Gejala ICH bervariasi tergantung pada lokasi dan tingkat keparahan perdarahan, dan dapat berkisar dari sakit kepala dan pusing hingga kehilangan kesadaran atau kematian. Perhatian medis segera diperlukan untuk menangani ICH, dan pendekatan pengobatan tergantung pada penyebab, jenis, dan tingkat keparahan perdarahan.

# typesOfICH
source: Types of Intracranial Hemorrhage
id: Jenis Perdarahan Intrakranial

source: Start Classification
id: Mulai Klasifikasi

source: Upload DICOM File
id: Unggah File DICOM

# selectDicomFile
source: Select DICOM File from Device
id: Pilih File DICOM dari Perangkat

source: File Selected:
id: File Dipilih:

source: Upload and Classify
id: Unggah dan Klasifikasi

source: Remove File
id: Hapus File

source: Select Example DICOM File
id: Pilih Contoh File DICOM

source: Important Diagnostic Disclaimer
id: Pernyataan Penting Terkait Diagnosis

# uploadAndClassificationDescription
source: This system is designed to assist in detecting and classifying intracranial hemorrhage using deep learning. The results can be used as a reference but are still recommended to be consulted with a professional healthcare provider.
id: Sistem ini dirancang untuk membantu mendeteksi dan mengklasifikasikan perdarahan intrakranial menggunakan deep learning. Hasilnya dapat digunakan sebagai referensi tetapi tetap disarankan untuk dikonsultasikan dengan penyedia layanan kesehatan profesional.

source: HeatMap Detection
id: Deteksi HeatMap

source: Processed Image
id: Gambar yang Diproses

source: Classification Result
id: Hasil Klasifikasi

source: No heatmap generated yet
id: Belum ada heatmap yang dihasilkan

source: No processed image available
id: Tidak ada gambar yang diproses

source: No Classification result available
id: Tidak ada hasil klasifikasi yang tersedia

source: No images available.
id: Tidak ada gambar yang tersedia.

source: Prediction:
id: Prediksi:

source: Positive
id: Positif

source: Negative
id: Negatif

source: Prediction Details:
id: Detail Prediksi:

source: Classification result will display here.
id: Hasil klasifikasi akan ditampilkan di sini.

source: No heatmap data available.
id: Tidak ada data heatmap yang tersedia.

source: Confidence:
id: Kepercayaan:

source: Location:
id: Lokasi:

source: Causes:
id: Penyebab:

source: Characteristics:
id: Karakteristik:

source: Symptoms:
id: Gejala:

source: Previous Image
id: Gambar Sebelumnya

source: Next Image
id: Gambar Berikutnya

# goToICHClass
source: Go to ICH Classification Page
id: Ke Halaman Klasifikasi ICH

source: Example of Subdural Hemorrhage
id: Contoh Perdarahan Subdural

source: Example of Subarachnoid Hemorrhage
id: Contoh Perdarahan Subarachnoid

source: Example of Intraventricular Hemorrhage
id: Contoh Perdarahan Intraventricular

source: Example of Intraparenchymal Hemorrhage
id: Contoh Perdarahan Intraparenchymal

source: Example of Epidural Hemorrhage
id: Contoh Perdarahan Epidural

source: Subdural Hemorrhage
id: Perdarahan Subdural

# whatIsSubduralHemorrhage
source: What is a Subdural Hemorrhage?
id: Apa itu Perdarahan Subdural?

# subduralDescription
source: A subdural hemorrhage (SDH) occurs when blood collects between the dura mater (the outermost protective layer of the brain) and the arachnoid layer. This bleeding often happens after a head injury, such as a fall, car accident, or a hard blow to the head. In older adults or those who frequently consume alcohol, even a minor injury can cause this type of bleeding because the blood vessels around the brain become more fragile. The pooled blood can press on the brain and lead to serious complications if not treated promptly.
id: Perdarahan subdural (SDH) adalah kondisi di mana darah terkumpul di antara dua lapisan pelindung otak, yaitu dura mater (lapisan terluar) dan lapisan arachnoid. Darah yang terkumpul ini dapat menekan otak dan menyebabkan masalah serius. Perdarahan subdural sering terjadi setelah cedera kepala, seperti jatuh, kecelakaan mobil, atau benturan keras. Pada orang lanjut usia atau mereka yang sering mengonsumsi alkohol, bahkan cedera ringan bisa menyebabkan Perdarahan ini karena pembuluh darah di sekitar otak lebih rapuh.

# subduralLocation
source: The bleeding occurs between the dura mater (the outermost brain layer) and the arachnoid layer.
id: Perdarahan terjadi di antara dura mater (lapisan terluar otak) dan lapisan arachnoid.

# subduralCause1
source: Head injuries, such as falls or car accidents, which cause small blood vessels around the brain to rupture.
id: Cedera kepala, seperti jatuh atau kecelakaan mobil, yang menyebabkan pembuluh darah kecil di sekitar otak pecah.

# subduralCause2
source: In older adults or heavy alcohol users, even minor injuries can cause subdural bleeding due to brain shrinkage and fragile blood vessels.
id: Pada orang lanjut usia atau mereka yang sering mengonsumsi alkohol, cedera ringan pun dapat menyebabkan Perdarahan subdural karena otak menyusut dan pembuluh darah menjadi lebih rentan.

# subduralCharacteristic1
source: Blood spreads over the surface of the brain and follows the brain's shape, appearing convex on imaging scans.
id: Darah menyebar di permukaan otak dan mengikuti bentuk otak, terlihat seperti bentuk cembung pada hasil pemindaian.

# subduralCharacteristic2
source: It can occur suddenly (acute), develop slowly (subacute), or persist over weeks to months (chronic).
id: Perdarahan subdural bisa terjadi secara tiba-tiba (akut), berkembang perlahan (subakut), atau bertahan dalam waktu lama (kronis).

# subduralSymptom1
source: Acute SDH: Rapid loss of consciousness, sudden severe headache, and focal neurological deficits like weakness.
id: Pada Perdarahan subdural akut: Kesadaran menurun dengan cepat, sakit kepala parah tiba-tiba, dan kelemahan atau gangguan saraf lainnya.

# subduralSymptom2
source: Chronic SDH: Gradual headache, confusion, memory problems, or weakness in the body.
id: Pada Perdarahan subdural kronis: Sakit kepala yang berkembang perlahan, kebingungan, masalah ingatan, atau kelemahan pada tubuh.

source: Subarachnoid Hemorrhage
id: Perdarahan Subarachnoid

# whatIsSubarachnoidHemorrhage
source: What is a Subarachnoid Hemorrhage?
id: Apa itu Perdarahan Subarachnoid?

# subarachnoidDescription
source: A subarachnoid hemorrhage (SAH) occurs when bleeding happens in the space between the arachnoid layer and the pia mater, two protective layers surrounding the brain. This space is normally filled with cerebrospinal fluid, which cushions the brain. SAH is often caused by the rupture of an aneurysm (a weak spot in a blood vessel) or other blood vessel abnormalities. The main symptom is a sudden, severe headache, often described as the 'worst headache of your life.' This condition is a medical emergency and requires immediate treatment.
id: Perdarahan subarachnoid (SAH) adalah kondisi di mana darah terkumpul di ruang antara dua lapisan pelindung otak, yaitu lapisan arachnoid dan pia mater. Ruang ini biasanya berisi cairan otak (cairan serebrospinal). Perdarahan ini sering disebabkan oleh pecahnya aneurisma, yaitu tonjolan lemah pada dinding pembuluh darah, atau kelainan pembuluh darah lainnya. Gejala utamanya adalah sakit kepala parah yang muncul tiba-tiba, sering digambarkan sebagai 'sakit kepala terburuk dalam hidup'. Kondisi ini sangat serius dan membutuhkan penanganan medis segera.

# subarachnoidLocation
source: The bleeding occurs in the subarachnoid space, between the arachnoid layer and the pia mater.
id: Perdarahan terjadi di ruang antara lapisan arachnoid dan pia mater, yang berada di sekitar otak.

# subarachnoidCause1
source: Rupture of an aneurysm (a bulging weak spot in a blood vessel).
id: Pecahnya aneurisma (tonjolan pada pembuluh darah).

# subarachnoidCause2
source: Rupture of an arteriovenous malformation (AVM), a tangle of abnormal blood vessels.
id: Pecahnya malformasi arteriovenosa (AVM), yaitu kelainan pembuluh darah.

# subarachnoidCharacteristic1
source: Blood is seen in the subarachnoid space on imaging scans.
id: Darah terlihat di ruang subarachnoid pada hasil pemindaian.

# subarachnoidCharacteristic2
source: It can cause a sudden, severe headache, often described as a 'thunderclap headache.'
id: Dapat menyebabkan sakit kepala yang sangat parah dan tiba-tiba, sering digambarkan sebagai 'sakit kepala terburuk dalam hidup'.

# subarachnoidSymptom1
source: Sudden, severe headache, often described as the worst headache ever experienced.
id: Sakit kepala parah yang muncul tiba-tiba, sering digambarkan sebagai sakit kepala terburuk yang pernah dialami.

# subarachnoidSymptom2
source: Nausea and vomiting.
id: Mual dan muntah.

# subarachnoidSymptom3
source: Stiff neck (nuchal rigidity).
id: Leher terasa kaku dan sulit digerakkan.

# subarachnoidSymptom4
source: Changes in mental status or loss of consciousness.
id: Perubahan kesadaran atau pingsan.

source: Intraventricular Hemorrhage
id: Perdarahan Intraventrikular

# whatIsIntraventricularHemorrhage
source: What is an Intraventricular Hemorrhage?
id: Apa itu Perdarahan Intraventrikular?

# intraventricularDescription
source: An intraventricular hemorrhage (IVH) occurs when bleeding happens inside the brain's ventricular system, which consists of fluid-filled spaces that produce and circulate cerebrospinal fluid. This type of bleeding is often caused by conditions like aneurysms, arteriovenous malformations (AVMs), or head trauma. The blood can block the flow of cerebrospinal fluid, leading to increased pressure inside the skull and potential brain damage. IVH is a serious condition that requires urgent medical attention.
id: Perdarahan intraventrikular (IVH) adalah kondisi di mana darah terkumpul di dalam ventrikel otak, yaitu ruang-ruang berisi cairan di dalam otak yang berfungsi untuk melindungi dan mengalirkan cairan otak. Perdarahan ini sering terjadi akibat pecahnya pembuluh darah di sekitar ventrikel, seperti pada kasus aneurisma, kelainan pembuluh darah, atau cedera kepala. Darah yang terkumpul di ventrikel dapat menghalangi aliran cairan otak, menyebabkan tekanan di dalam kepala meningkat dan berpotensi merusak jaringan otak. Kondisi ini sangat serius dan memerlukan penanganan medis segera.

# intraventricularLocation
source: The bleeding occurs inside the brain's ventricular system, including the lateral, third, and fourth ventricles.
id: Perdarahan terjadi di dalam ventrikel otak, termasuk ventrikel lateral, ventrikel ketiga, dan ventrikel keempat.

# intraventricularCause1
source: Rupture of an aneurysm.
id: Pecahnya aneurisma.

# intraventricularCause2
source: Arteriovenous malformation (AVM).
id: Kelainan pembuluh darah seperti malformasi arteriovenosa (AVM).

# intraventricularCause3
source: Head trauma.
id: Cedera kepala.

# intraventricularCause4
source: Uncontrolled high blood pressure.
id: Tekanan darah tinggi yang tidak terkontrol.

# intraventricularCause5
source: Blood clotting disorders.
id: Gangguan pembekuan darah.

# intraventricularCharacteristic1
source: Blood accumulates inside the brain's ventricles.
id: Darah terlihat di dalam ventrikel otak pada hasil pemindaian.

# intraventricularCharacteristic2
source: It can cause the ventricles to expand and increase intracranial pressure.
id: Dapat menyebabkan ventrikel otak membesar dan meningkatkan tekanan di dalam kepala.

# intraventricularCharacteristic3
source: Classified into grades I to IV based on the extent of bleeding and ventricular enlargement.
id: Dibagi menjadi empat tingkat (I-IV) berdasarkan seberapa parah Perdarahan dan pembesaran ventrikel.

# intraventricularSymptom1
source: Sudden headache.
id: Sakit kepala tiba-tiba.

# intraventricularSymptom2
source: Nausea and vomiting.
id: Mual dan muntah.

# intraventricularSymptom3
source: Neurological deficits, such as weakness or difficulty speaking.
id: Gangguan saraf seperti kelemahan atau kesulitan berbicara.

# intraventricularSymptom4
source: Changes in consciousness.
id: Perubahan kesadaran atau pingsan.

# intraventricularSymptom5
source: Seizures.
id: Kejang.

source: Intraparenchymal Hemorrhage
id: Perdarahan Intraparenkim

# whatIsIntraparenchymalHemorrhage
source: What is an Intraparenchymal Hemorrhage?
id: Apa itu Perdarahan Intraparenkim?

# intraparenchymalDescription
source: An intraparenchymal hemorrhage (IPH) occurs when bleeding happens within the brain tissue itself, usually due to the rupture of small blood vessels. This type of bleeding is often caused by high blood pressure, which weakens the blood vessel walls over time. Other causes include cerebral amyloid angiopathy (a condition where protein builds up in blood vessels, common in older adults) or vascular abnormalities like AVMs. The pooled blood can damage surrounding brain tissue and cause symptoms such as sudden severe headache, weakness, or difficulty speaking. IPH is a serious condition that requires immediate medical care.
id: Perdarahan intraparenkim (IPH) adalah kondisi di mana darah terkumpul di dalam jaringan otak itu sendiri. Ini terjadi ketika pembuluh darah kecil di dalam otak pecah, sering kali akibat tekanan darah tinggi yang tidak terkontrol atau kelainan pembuluh darah. Darah yang terkumpul dapat merusak jaringan otak di sekitarnya dan menyebabkan gejala seperti sakit kepala parah, kelemahan, atau kesulitan berbicara. Kondisi ini sangat serius dan memerlukan penanganan medis segera untuk mencegah kerusakan lebih lanjut.

# intraparenchymalLocation
source: The bleeding occurs within the brain tissue, usually in the white matter.
id: Perdarahan terjadi di dalam jaringan otak, biasanya di bagian putih otak.

# intraparenchymalCause1
source: High blood pressure causing small blood vessels to rupture.
id: Tekanan darah tinggi yang menyebabkan pecahnya pembuluh darah kecil.

# intraparenchymalCause2
source: Cerebral amyloid angiopathy (CAA), a condition common in older adults where protein builds up in blood vessels.
id: Angiopati amiloid otak (CAA), yaitu penumpukan protein abnormal di pembuluh darah otak, terutama pada orang lanjut usia.

# intraparenchymalCause3
source: Vascular abnormalities like arteriovenous malformations (AVMs) or aneurysms.
id: Kelainan pembuluh darah seperti malformasi arteriovenosa (AVM) atau aneurisma.

# intraparenchymalCharacteristic1
source: Blood is seen within the brain tissue on imaging scans like CT or MRI.
id: Darah terlihat di dalam jaringan otak pada hasil pemindaian seperti CT scan atau MRI.

# intraparenchymalCharacteristic2
source: It can cause damage to the surrounding brain tissue.
id: Dapat menyebabkan kerusakan jaringan otak di sekitarnya.

# intraparenchymalSymptom1
source: Sudden, severe headache, often described as the worst headache ever experienced.
id: Sakit kepala parah yang muncul tiba-tiba, sering digambarkan sebagai sakit kepala terburuk yang pernah dialami.

# intraparenchymalSymptom2
source: Nausea and vomiting.
id: Mual dan muntah.

# intraparenchymalSymptom3
source: Neurological deficits, such as weakness, numbness, or difficulty speaking.
id: Gangguan saraf seperti kelemahan, mati rasa, atau kesulitan berbicara.

# intraparenchymalSymptom4
source: Loss of consciousness in severe cases.
id: Pingsan atau kehilangan kesadaran dalam kasus yang parah.

source: Epidural Hemorrhage
id: Perdarahan Epidural

# whatIsEpiduralHemorrhage
source: What is an Epidural Hemorrhage?
id: Apa itu Perdarahan Epidural?

# epiduralDescription
source: An epidural hemorrhage (EDH) occurs when blood collects between the dura mater (the outermost protective layer of the brain) and the skull. This condition is usually caused by a head injury, such as a car accident or a fall, which tears the middle meningeal artery. The pooled blood can press on the brain and cause symptoms like severe headache, nausea, vomiting, and loss of consciousness. Epidural hemorrhage is a medical emergency that requires immediate treatment to prevent life-threatening complications.
id: Perdarahan epidural (EDH) adalah kondisi di mana darah terkumpul di antara lapisan terluar otak (dura mater) dan tulang tengkorak. Kondisi ini biasanya terjadi setelah cedera kepala, seperti kecelakaan mobil atau jatuh, yang menyebabkan pecahnya pembuluh darah, terutama arteri meningeal media. Darah yang terkumpul dapat menekan otak dan menyebabkan gejala seperti sakit kepala parah, mual, muntah, dan kehilangan kesadaran. Perdarahan epidural adalah kondisi darurat medis yang memerlukan penanganan segera untuk mencegah kerusakan otak yang lebih parah.

# epiduralLocation
source: The bleeding occurs between the dura mater and the skull.
id: Perdarahan terjadi di antara dura mater (lapisan terluar otak) dan tulang tengkorak.

# epiduralCause1
source: Head trauma, such as car accidents or falls, which tears the middle meningeal artery.
id: Cedera kepala, seperti kecelakaan mobil atau jatuh, yang menyebabkan pecahnya arteri meningeal media.

# epiduralCause2
source: In rare cases, it can occur spontaneously in individuals with certain vascular conditions.
id: Pada kasus yang jarang, perdarahan epidural dapat terjadi secara spontan pada orang dengan kelainan pembuluh darah.

# epiduralCharacteristic1
source: Blood collects between the dura mater and the skull.
id: Darah terkumpul di antara dura mater dan tulang tengkorak.

# epiduralCharacteristic2
source: It is usually caused by a tear in the middle meningeal artery.
id: Biasanya disebabkan oleh pecahnya arteri meningeal media.

# epiduralSymptom1
source: Severe headache.
id: Sakit kepala parah.

# epiduralSymptom2
source: Nausea and vomiting.
id: Mual dan muntah.

# epiduralSymptom3
source: Loss of consciousness.
id: Kehilangan kesadaran.

# epiduralSymptom4
source: Stiff neck.
id: Leher kaku.

# epiduralSymptom5
source: Changes in mental status, such as confusion or decreased alertness.
id: Perubahan status mental, seperti kebingungan atau penurunan kesadaran.
